Revit 2024 API
SpatialFieldManager.GetSpatialFieldManager Method
 Retrieves manager object for the given view or returns NULL
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public static SpatialFieldManager GetSpatialFieldManager(
	View view
)
Visual Basic
Public Shared Function GetSpatialFieldManager ( _
	view As View _
) As SpatialFieldManager
Visual C++
public:
static SpatialFieldManager^ GetSpatialFieldManager(
	View^ view
)
Parameters
view
Type: Autodesk.Revit.DB.View
 View for which manager object is retrieved
Return Value
 Manager object for the view passed in the argument
See Also
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace